package com.github.NatalyaZay.module02;

public class ProgramTask35 {
    /*
    - Объект абстрактного класса создать нельзя.
    - Конструктор для абстрактного класса создать можно.
    - Не абстрактный метод в абстрактном классе может быть.
    - Не абстрактные методы и абстрактные методы могут быть в абстрактном классе .
    - Абстракный метод не может быть в не абстрактном классе, иначе он тоже должен стать абстрактным.
    - Можно переопределить не абстрактный метод.
    - Не все методы интерфейса абстрактны, есть default методы.
    - Можно создать интерфейс без методов.
    - Абстракный класс наследуется (один раз) , интерфейс имплементируется (много раз).
    У интерфейса нет переменных класса и конструктора.
     */
}
